<a href="https://colab.research.google.com/github/Samxiar/analylitia/blob/main/Data_Cleaning.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Note That This is a Generalized form of Data Cleaning and the Process or the methods may vary from data to data.**

In [1]:
import pandas as pd
import numpy as np

In [2]:
df =  pd.read_csv("/content/global life expectancy dataset.csv")

In [3]:
df.head(5)

,Country Name,Country Code,1960,1961,1962,1963,1964,1965,1966,1967,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
0,Aruba,ABW,65.662,66.074,66.444,66.787,67.113,67.435,67.762,68.095,...,75.158,75.299,75.441,75.583,75.725,75.868,76.010,76.152,76.293,76.434
1,Afghanistan,AFG,32.446,32.962,33.471,33.971,34.463,34.948,35.430,35.914,...,61.553,62.054,62.525,62.966,63.377,63.763,64.130,64.486,64.833,65.173
2,Angola,AGO,37.524,37.811,38.113,38.430,38.760,39.102,39.454,39.813,...,56.330,57.236,58.054,58.776,59.398,59.925,60.379,60.782,61.147,61.487
3,Albania,ALB,62.283,63.301,64.190,64.914,65.463,65.850,66.110,66.304,...,76.914,77.252,77.554,77.813,78.025,78.194,78.333,78.458,78.573,78.686
4,United Arab Emirates,ARE,51.537,52.560,53.573,54.572,55.555,56.523,57.482,58.432,...,76.521,76.711,76.903,77.095,77.285,77.470,77.647,77.814,77.972,78.120

In [4]:
df.drop_duplicates(inplace=True)

In [5]:
if df.isnull().values.any():
    print("DataFrame has null values")
else:
    print("DataFrame has no null values")

DataFrame has null values

In [6]:
n_cols = df.select_dtypes(include='number').columns
df[n_cols] = df[n_cols].fillna(df[n_cols].median())

In [7]:
if df.isnull().values.any():
    print("DataFrame has null values")
else:
    print("DataFrame has no null values")

DataFrame has no null values

In [8]:
#using Lambda to lowercase all the strings 
df = df.apply(lambda x: x.str.lower() if x.dtype == 'object' else x)

In [9]:
# Used for loop to print the years in the column to copypaste lol
years = []
for year in range(1960, 2021):
    years.append('{}'.format(year))
print(years)

['1960', '1961', '1962', '1963', '1964', '1965', '1966', '1967', '1968', '1969', '1970', '1971', '1972', '1973', '1974', '1975', '1976', '1977', '1978', '1979', '1980', '1981', '1982', '1983', '1984', '1985', '1986', '1987', '1988', '1989', '1990', '1991', '1992', '1993', '1994', '1995', '1996', '1997', '1998', '1999', '2000', '2001', '2002', '2003', '2004', '2005', '2006', '2007', '2008', '2009', '2010', '2011', '2012', '2013', '2014', '2015', '2016', '2017', '2018', '2019', '2020']

In [10]:
def outliers(df, columns):
    for col in columns:
        # Calculate the Z-scores for the column
        z_scores = np.abs((df[col] - df[col].mean()) / df[col].std())

        # Remove rows with Z-score greater than 3
        df = df[z_scores < 3]

    return df

In [11]:
columns_to_remove_outliers = ['1960', '1961', '1962', '1963', '1964', '1965', '1966', '1967', '1968', '1969', '1970', '1971', '1972', '1973', '1974', '1975', '1976', '1977', '1978', '1979', '1980', '1981', '1982', '1983', '1984', '1985', '1986', '1987', '1988', '1989', '1990', '1991', '1992', '1993', '1994', '1995', '1996', '1997', '1998', '1999', '2000', '2001', '2002', '2003', '2004', '2005', '2006', '2007', '2008', '2009', '2010', '2011', '2012', '2013', '2014', '2015', '2016', '2017', '2018', '2019', '2020']

In [12]:
df = outliers(df, columns_to_remove_outliers)

In [13]:
df.head

<bound method NDFrame.head of              Country Name Country Code    1960     1961       1962    1963  \
0                   aruba          abw  65.662  66.0740  66.444000  66.787
1             afghanistan          afg  32.446  32.9620  33.471000  33.971
2                  angola          ago  37.524  37.8110  38.113000  38.430
3                 albania          alb  62.283  63.3010  64.190000  64.914
4    united arab emirates          are  51.537  52.5600  53.573000  54.572
..                    ...          ...     ...      ...        ...     ...
200                kosovo          xkx  54.701  55.5215  56.128659  56.231
201           yemen, rep.          yem  29.919  30.1630  30.500000  30.943
202          south africa          zaf  48.406  48.7770  49.142000  49.509
203                zambia          zmb  46.687  47.0840  47.446000  47.772
204              zimbabwe          zwe  53.019  53.4830  53.946000  54.403

       1964       1965       1966    1967  ...    2011       2012       2013  \
0    67.113  67.435000  67.762000  68.095  ...  75.158  75.299000  75.441000
1    34.463  34.948000  35.430000  35.914  ...  61.553  62.054000  62.525000
2    38.760  39.102000  39.454000  39.813  ...  56.330  57.236000  58.054000
3    65.463  65.850000  66.110000  66.304  ...  76.914  77.252000  77.554000
4    55.555  56.523000  57.482000  58.432  ...  76.521  76.711000  76.903000
..      ...        ...        ...     ...  ...     ...        ...        ...
200  57.182  58.105146  58.608585  59.006  ...  70.200  70.497561  70.797561
201  31.501  32.175000  32.960000  33.836  ...  65.768  65.920000  66.016000
202  49.888  50.284000  50.705000  51.148  ...  58.895  60.060000  61.099000
203  48.068  48.351000  48.643000  48.960  ...  57.126  58.502000  59.746000
204  54.849  55.274000  55.671000  56.034  ...  52.896  55.032000  56.897000

          2014       2015       2016       2017       2018       2019  \
0    75.583000  75.725000  75.868000  76.010000  76.152000  76.293000
1    62.966000  63.377000  63.763000  64.130000  64.486000  64.833000
2    58.776000  59.398000  59.925000  60.379000  60.782000  61.147000
3    77.813000  78.025000  78.194000  78.333000  78.458000  78.573000
4    77.095000  77.285000  77.470000  77.647000  77.814000  77.972000
..         ...        ...        ...        ...        ...        ...
200  71.097561  71.346341  71.846341  72.295122  72.695122  73.092683
201  66.066000  66.085000  66.087000  66.086000  66.096000  66.125000
202  61.968000  62.649000  63.153000  63.538000  63.857000  64.131000
203  60.831000  61.737000  62.464000  63.043000  63.510000  63.886000
204  58.410000  59.534000  60.294000  60.812000  61.195000  61.490000

          2020
0    76.434000
1    65.173000
2    61.487000
3    78.686000
4    78.120000
..         ...
200  71.087805
201  66.181000
202  64.379000
203  64.194000
204  61.738000

[201 rows x 63 columns]>